[
    {
        "description":"Allah taught Adam all the names of the plants and animals which must have taken a while since there are 1.7 million species that are known with probably another 10 million or so that are yet to be discovered. And this only includes those that are alive today. If extinct species are included then Allah must have taught Adam a billion or so names. ",
        "url":"https:\/\/quran.com\/2?startingVerse=31"
    },
    {
        "description":"Quran incorrectly claims Kaaba was built by Abraham and Ishmael.",
        "url":"https:\/\/quran.com\/2?startingVerse=127"
    },
    {
        "description":"There are a hundred billion galaxies each with a hundred billion or so stars. And according to this verse they all were created by Allah to help people navigate.",
        "url":"https:\/\/quran.com\/6?startingVerse=97"
    },
    {
        "description":"Homosexual acts are condemned as unnatural. (Will ye commit abomination such as no creature ever did before you?) But in fact such acts are common in many other species.",
        "url":"https:\/\/quran.com\/7?startingVerse=80"
    },
    {
        "description":"Crucifixion is a Roman punishment unknown in Egypt at the time this story supposedly occurred.",
        "url":"https:\/\/quran.com\/7?startingVerse=124"
    },
    {
        "description":"When Allah revealed himself to Moses the (Mt. Sinai?) came crashing down.",
        "url":"https:\/\/quran.com\/7?startingVerse=143"
    },
    {
        "description":"Humans created from a single man.",
        "url":"https:\/\/quran.com\/7?startingVerse=189"
    },
    {
        "description":"Allah thinks that humans have their brains in their breasts.",
        "url":"https:\/\/quran.com\/11?startingVerse=5"
    },
    {
        "description":"The earth is flat according to the Quran.",
        "url":"https:\/\/quran.com\/15?startingVerse=19"
    },
    {
        "description":"Allah told bees to eat from all fruits but they decided to eat nectar and pollen instead.",
        "url":"https:\/\/quran.com\/16?startingVerse=68"
    },
    {
        "description":"The sun rises and sets at particular places on a flat earth. At the westernmost point on earth the sun sets in a muddy spring.",
        "url":"https:\/\/quran.com\/18?startingVerse=90"
    },
    {
        "description":"The Pharaoh threatens to crucify Hebrews on palm trees. (But crucifixion was a Roman form of punishment that was unknown at the time.)",
        "url":"https:\/\/quran.com\/20?startingVerse=71"
    },
    {
        "description":"The sun stars and earth were joined together until Allah separated them about six thousand years ago.",
        "url":"https:\/\/quran.com\/21?startingVerse=30"
    },
    {
        "description":"The sun floats in an orbit around the earth.",
        "url":"https:\/\/quran.com\/21?startingVerse=33"
    },
    {
        "description":"O mankind! If ye are in doubt concerning the Resurrection then lo! We have created you from dust then from a drop of seed then from a clot then from a little lump of flesh shapely and shapeless that We may make it clear for you. Oh thanks Allah! That clears everything up!",
        "url":"https:\/\/quran.com\/22?startingVerse=5"
    },
    {
        "description":"Allah created man from wet earth.",
        "url":"https:\/\/quran.com\/23?startingVerse=12"
    },
    {
        "description":"Allah created all animals. Some with no legs some with two and some with four. (Allah forgot about the insects?)",
        "url":"https:\/\/quran.com\/24?startingVerse=45"
    },
    {
        "description":"The earth is fixed and does not move.",
        "url":"https:\/\/quran.com\/27?startingVerse=61"
    },
    {
        "description":"For the moon We have appointed mansions till she return like an old shriveled palm-leaf.",
        "url":"https:\/\/quran.com\/36?startingVerse=38"
    },
    {
        "description":"Allah says that the sun and the earth travel around the earth in the same orbit. Allah doesn't know about eclipses.",
        "url":"https:\/\/quran.com\/36?startingVerse=40"
    },
    {
        "description":"Allah forced the sun and moon into service.",
        "url":"https:\/\/quran.com\/39?startingVerse=5"
    },
    {
        "description":"He created you in the wombs of your mothers creation after creation in a threefold gloom.",
        "url":"https:\/\/quran.com\/39?startingVerse=6"
    },
    {
        "description":"He made eight kinds of cattle.",
        "url":"https:\/\/quran.com\/39?startingVerse=6"
    },
    {
        "description":"He created you from one being then from that being he made its mate.",
        "url":"https:\/\/quran.com\/39?startingVerse=6"
    },
    {
        "description":"Allah put lamps in the lower heaven to serve as lights. These are the stars that we see in the sky at night.",
        "url":"https:\/\/quran.com\/41?startingVerse=12"
    },
    {
        "description":"Muhammad split the moon into two pieces.",
        "url":"https:\/\/quran.com\/54?startingVerse=1"
    },
    {
        "description":"Allah created man from clay.",
        "url":"https:\/\/quran.com\/55?startingVerse=14"
    },
    {
        "description":"Allah is Lord of the two easts and two wests!",
        "url":"https:\/\/quran.com\/55?startingVerse=17"
    },
    {
        "description":"He has let loose the two seas. There's a barrier between them so they don't meet.",
        "url":"https:\/\/quran.com\/55?startingVerse=19"
    },
    {
        "description":"Some day the heaven will split and turn a rosy-red color.",
        "url":"https:\/\/quran.com\/55?startingVerse=37"
    },
    {
        "description":"Allah created the heavens and earth in six days. Then he mounted the throne.",
        "url":"https:\/\/quran.com\/57?startingVerse=0"
    },
    {
        "description":"All natural disasters are planned by Allah to cause human suffering. He does it by the Book. It's easy for Allah!",
        "url":"https:\/\/quran.com\/57?startingVerse=22"
    },
    {
        "description":"Allah has created seven heavens. No one knows where these seven heavens are or what they're supposed to be.",
        "url":"https:\/\/quran.com\/65?startingVerse=12"
    },
    {
        "description":"Allah created seven heavens. Can you see any cracks in them?",
        "url":"https:\/\/quran.com\/67?startingVerse=3"
    },
    {
        "description":"Allah made the stars as missiles to throw at devils.",
        "url":"https:\/\/quran.com\/67?startingVerse=5"
    },
    {
        "description":"If all the water disappears on earth who will bring your water? ",
        "url":"https:\/\/quran.com\/67?startingVerse=30"
    },
    {
        "description":"The reality! What is reality? ",
        "url":"https:\/\/quran.com\/69?startingVerse=1"
    },
    {
        "description":"At the end of the world the earth with the mountains will be lifted up and crushed with one crash. ",
        "url":"https:\/\/quran.com\/69?startingVerse=14"
    },
    {
        "description":"Muhammad claims that the moon produces its own light rather than reflecting light from the sun.",
        "url":"https:\/\/quran.com\/71?startingVerse=16"
    },
    {
        "description":"Do people think we can't assemble their bones? Heck. We can assemble their very fingers!",
        "url":"https:\/\/quran.com\/75?startingVerse=3"
    },
    {
        "description":"They ask: When will be this resurrection day? It'll be when the moon is eclipsed and the sun and moon are united.",
        "url":"https:\/\/quran.com\/75?startingVerse=6"
    },
    {
        "description":"Is he able to bring the dead to life?",
        "url":"https:\/\/quran.com\/75?startingVerse=40"
    },
    {
        "description":"Has there ever been a time when humans did not exist?",
        "url":"https:\/\/quran.com\/76?startingVerse=1"
    },
    {
        "description":"Allah created man from a drop of thickened fluid.",
        "url":"https:\/\/quran.com\/76?startingVerse=2"
    },
    {
        "description":"When the stars are put out the sky is ripped apart and the mountains blown away on the day of decision.",
        "url":"https:\/\/quran.com\/77?startingVerse=8"
    },
    {
        "description":"We [Allah] have built above you seven strong heavens. And a dazzling lamp.",
        "url":"https:\/\/quran.com\/78?startingVerse=12"
    },
    {
        "description":"Someday the sun will be overthrown the stars will fall the hills will be moved and the sky will be torn away.",
        "url":"https:\/\/quran.com\/81?startingVerse=1"
    },
    {
        "description":"Someday heaven will split the planets scatter the seas flood and the graves will be overturned.",
        "url":"https:\/\/quran.com\/82?startingVerse=1"
    },
    {
        "description":"What will tell you about the morning star? The answer of course is science. The morning star is the planet Venus when it is visible in the morning sky.",
        "url":"https:\/\/quran.com\/86?startingVerse=2"
    },
    {
        "description":"Humans are created from a gushing fluid issued from between the loins and ribs.",
        "url":"https:\/\/quran.com\/86?startingVerse=6"
    },
    {
        "description":"And the earth - how it is spread? If the earth is spread it must be flat.",
        "url":"https:\/\/quran.com\/88?startingVerse=20"
    },
    {
        "description":"The moon follows the sun - according to Muhammad.",
        "url":"https:\/\/quran.com\/91?startingVerse=1"
    },
    {
        "description":"The earth and Him Who spread it- Allah spread the earth out flat like a pancake.",
        "url":"https:\/\/quran.com\/91?startingVerse=6"
    },
    {
        "description":"If he denies Allah's guidance - We will seize him by the forelock - The lying sinful forelock.",
        "url":"https:\/\/quran.com\/96?startingVerse=13"
    },
    {
        "description":"At the end of the world Allah will cause a massive earthquake and then send everyone to heaven or hell.",
        "url":"https:\/\/quran.com\/99?startingVerse=1"
    },
    {
        "description":"Allah sent swarms of flying creatures that dropped stones on the owners of the elephants.",
        "url":"https:\/\/quran.com\/105?startingVerse=2"
    }
]