[
    {
        "description":"Virgins await those who enter paradise.",
        "url":"https:\/\/quran.com\/2?startingVerse=25"
    },
    {
        "description":"It's OK to have sex with your wives during Ramadan (at least after sunset). In fact you must have sex with them. All of them. It is your sacred Muslim duty.",
        "url":"https:\/\/quran.com\/2?startingVerse=187"
    },
    {
        "description":"Menstruation is a filthy disease. All good Muslim men should stay the hell away from menstruating women. And for God sakes don't have sex with them while they're menstruating. It creeps Allah out just to think of it.",
        "url":"https:\/\/quran.com\/2?startingVerse=222"
    },
    {
        "description":"Allah loves clean sex as much as he hates menstruating women.",
        "url":"https:\/\/quran.com\/2?startingVerse=222"
    },
    {
        "description":"In the mind of Allah women are like a dirty field for men to plow with their penises. Plow them whenever you like - as long as they're not menstruating of course.",
        "url":"https:\/\/quran.com\/2?startingVerse=223"
    },
    {
        "description":"If a man doesn't want to have sex with his wives Allah is OK with that too. Wait four months then if they change their minds go ahead and have sex with them.",
        "url":"https:\/\/quran.com\/2?startingVerse=226"
    },
    {
        "description":"Women may not have sex for three months after getting a divorce. If they skip one of their filthy periods they must not hide it. In such a case Allah suggests that their ex-husbands take their pregnant wives back.",
        "url":"https:\/\/quran.com\/2?startingVerse=228"
    },
    {
        "description":"Women have rights that are similar to men but men are a degree above them.",
        "url":"https:\/\/quran.com\/2?startingVerse=228"
    },
    {
        "description":"If you divorce your wife you must divorce her twice. And she can ransom herself - whatever that might mean.",
        "url":"https:\/\/quran.com\/2?startingVerse=229"
    },
    {
        "description":"But if you divorce your wife for the third time you can't have her again until she has sex with another guy. Then if the other guy divorces her it's OK for you to have sex with your four-times divorced wife.",
        "url":"https:\/\/quran.com\/2?startingVerse=230"
    },
    {
        "description":"After your divorced wives have reached the end of their 3 month waiting period you can take them or leave them.",
        "url":"https:\/\/quran.com\/2?startingVerse=231"
    },
    {
        "description":"If you decide to go ahead with the divorce let your ex-wives get married again. It's cleaner that way. Allah knows; you don't.",
        "url":"https:\/\/quran.com\/2?startingVerse=232"
    },
    {
        "description":"When a man dies his wives can't have sex for four months and ten days. After that if they're not pregnant it's no sin for the dead man if his wives have sex again.",
        "url":"https:\/\/quran.com\/2?startingVerse=234"
    },
    {
        "description":"A woman is worth one-half a man.",
        "url":"https:\/\/quran.com\/2?startingVerse=282"
    },
    {
        "description":"It's OK to have two or three or four wives - slave or free.",
        "url":"https:\/\/quran.com\/4?startingVerse=3"
    },
    {
        "description":"Males are to inherit twice that of females.",
        "url":"https:\/\/quran.com\/4?startingVerse=11"
    },
    {
        "description":"Lewd women are to be confined to their houses until death.",
        "url":"https:\/\/quran.com\/4?startingVerse=15"
    },
    {
        "description":"If any of your women get lewd cut off their inheritance.",
        "url":"https:\/\/quran.com\/4?startingVerse=19"
    },
    {
        "description":"Instructions for exchanging wives.",
        "url":"https:\/\/quran.com\/4?startingVerse=20"
    },
    {
        "description":"Don't marry women that are already married -- unless they're slaves that you obtained in war. Then it's OK. ",
        "url":"https:\/\/quran.com\/4?startingVerse=24"
    },
    {
        "description":"If your slave wives are guilty of lewdness punish them half as much as you punish your lewd free wives.",
        "url":"https:\/\/quran.com\/4?startingVerse=25"
    },
    {
        "description":"If you can't afford to marry free Muslims women go ahead and marry slaves as long as they're Muslims.",
        "url":"https:\/\/quran.com\/4?startingVerse=25"
    },
    {
        "description":"Men are in charge of women because Allah made men to be better than women. Women must obey men and if they refuse they must be punished.",
        "url":"https:\/\/quran.com\/4?startingVerse=34"
    },
    {
        "description":"Don't pray if you are drunk or dirty or have touched a woman lately.",
        "url":"https:\/\/quran.com\/4?startingVerse=43"
    },
    {
        "description":"Virgins await those who enter paradise.",
        "url":"https:\/\/quran.com\/4?startingVerse=57"
    },
    {
        "description":"They invoke in Allah's stead only females.",
        "url":"https:\/\/quran.com\/4?startingVerse=117"
    },
    {
        "description":"Don't bother trying to treat your wives fairly. It's impossible.",
        "url":"https:\/\/quran.com\/4?startingVerse=129"
    },
    {
        "description":"Unto the male is the equivalent share of two females.",
        "url":"https:\/\/quran.com\/4?startingVerse=176"
    },
    {
        "description":"When it's time to pray and you have just used the toilet or touched a woman - be sure to wash up. If you can't find any water just rub some dirt on yourself.",
        "url":"https:\/\/quran.com\/5?startingVerse=6"
    },
    {
        "description":"Men and women are enemies!",
        "url":"https:\/\/quran.com\/7?startingVerse=24"
    },
    {
        "description":"If your wives are dearer to you than Allah and His messenger then wait till Allah brings His command to pass.",
        "url":"https:\/\/quran.com\/0?startingVerse=0"
    },
    {
        "description":"Lot offers his daughters to a mob of angel rapers.",
        "url":"https:\/\/quran.com\/11?startingVerse=78"
    },
    {
        "description":"The guile of women is very great.",
        "url":"https:\/\/quran.com\/12?startingVerse=28"
    },
    {
        "description":"Lot offers his daughters to a mob of angel rapists",
        "url":"https:\/\/quran.com\/15?startingVerse=71"
    },
    {
        "description":"You don't have to be modest around your wives or your slave girls (that your right hand possess).",
        "url":"https:\/\/quran.com\/23?startingVerse=6"
    },
    {
        "description":"If you accuse an honorable women of adultery be sure to bring four witnesses. Otherwise you will receive 80 lashes.",
        "url":"https:\/\/quran.com\/24?startingVerse=4"
    },
    {
        "description":"A husband can accuse his wife of adultery with only one witness (himself). But he has to swear five times (so he can count as four or more separate witnesses.",
        "url":"https:\/\/quran.com\/24?startingVerse=6"
    },
    {
        "description":"Believing women must lower their gaze and be modest - cover themselves with veils and not reveal themselves except to their husbands and relatives and children and slaves.",
        "url":"https:\/\/quran.com\/24?startingVerse=31"
    },
    {
        "description":"Force not your slave-girls to whoredom - don't pimp out your slave-girls.",
        "url":"https:\/\/quran.com\/24?startingVerse=33"
    },
    {
        "description":"The prophet [Muhammad] is closer to believers than their own selves. And his wives are like their own mothers.",
        "url":"https:\/\/quran.com\/33?startingVerse=6"
    },
    {
        "description":"If Muhammad's wives are good Allah will give them an immense reward.",
        "url":"https:\/\/quran.com\/33?startingVerse=28"
    },
    {
        "description":"The wives of Muhammad will be punished double for lewdness. (And that is easy for Allah.)",
        "url":"https:\/\/quran.com\/33?startingVerse=30"
    },
    {
        "description":"The wives of Muhammad are not like other women. They must not leave their houses.",
        "url":"https:\/\/quran.com\/33?startingVerse=32"
    },
    {
        "description":"When Allah or Muhammad decide that a man and a woman should marry - they must marry.",
        "url":"https:\/\/quran.com\/33?startingVerse=36"
    },
    {
        "description":"Allah gave Zeyd to Muhammad in marriage. This was so that all Muslims would know that it's OK to marry your adopted son's ex-wife.",
        "url":"https:\/\/quran.com\/33?startingVerse=37"
    },
    {
        "description":"Allah says it is lawful for Muhammad to marry any woman and however many women he wants.",
        "url":"https:\/\/quran.com\/33?startingVerse=50"
    },
    {
        "description":"If men must speak to Muhammad's wives they must speak from behind a curtain. And no one must ever marry one of his wives.",
        "url":"https:\/\/quran.com\/33?startingVerse=53"
    },
    {
        "description":"But it's OK for Muhammad's wives to talk with certain people.",
        "url":"https:\/\/quran.com\/33?startingVerse=55"
    },
    {
        "description":"Wives and daughters must draw their cloaks about them when they go outside.",
        "url":"https:\/\/quran.com\/33?startingVerse=59"
    },
    {
        "description":"The men in paradise will be happily employed with their wives.",
        "url":"https:\/\/quran.com\/36?startingVerse=55"
    },
    {
        "description":"Those who \"did wrong\" will go to hell and their wives will go to hell with them (no matter how they behaved).",
        "url":"https:\/\/quran.com\/37?startingVerse=22"
    },
    {
        "description":"But the single-minded slaves of Allah will enjoy a Garden filled with lovely-eyed virgins.",
        "url":"https:\/\/quran.com\/37?startingVerse=40"
    },
    {
        "description":"Did we create any female angels? No we didn't.",
        "url":"https:\/\/quran.com\/37?startingVerse=150"
    },
    {
        "description":"Allah doesn't prefer daughters to sons.",
        "url":"https:\/\/quran.com\/37?startingVerse=153"
    },
    {
        "description":"Female companions await those who enter the Gardens of Eden on the Day of Reckoning.",
        "url":"https:\/\/quran.com\/38?startingVerse=52"
    },
    {
        "description":"All of Allah's angels are males.",
        "url":"https:\/\/quran.com\/43?startingVerse=19"
    },
    {
        "description":"O My slaves!Enter the Garden - ye and your wives.",
        "url":"https:\/\/quran.com\/43?startingVerse=68"
    },
    {
        "description":"Allah will provide beautiful wives for the men in the garden. He doesn't say what the women will get.",
        "url":"https:\/\/quran.com\/44?startingVerse=54"
    },
    {
        "description":"Allah will reward those in the Garden with beautiful wives with wide lovely eyes. It doesn't say what the women will get.",
        "url":"https:\/\/quran.com\/52?startingVerse=20"
    },
    {
        "description":"Those who disbelieve in the hereafter have female angels.",
        "url":"https:\/\/quran.com\/53?startingVerse=27"
    },
    {
        "description":"Allah will give those in the Garden women of modest gaze whom neither man nor jinn have touched.",
        "url":"https:\/\/quran.com\/55?startingVerse=70"
    },
    {
        "description":"Those in the Garden will be attended by immortal youths with wide lovely eyes.",
        "url":"https:\/\/quran.com\/56?startingVerse=17"
    },
    {
        "description":"Allah made virgins to be lovers and friends to those on his right hand.",
        "url":"https:\/\/quran.com\/56?startingVerse=36"
    },
    {
        "description":"A man who remarries a wife (whom he previously divorced by saying she was like his mother) must free a slave before he touches her again.",
        "url":"https:\/\/quran.com\/58?startingVerse=3"
    },
    {
        "description":"Your wives and children are your enemies. They are to you only a temptation.",
        "url":"https:\/\/quran.com\/0?startingVerse=0"
    },
    {
        "description":"Instructions for divorcing your wives.",
        "url":"https:\/\/quran.com\/65?startingVerse=1"
    },
    {
        "description":"Allah's rules for divorcing wives that have not yet reached puberty.",
        "url":"https:\/\/quran.com\/65?startingVerse=4"
    },
    {
        "description":"Allah says it's OK for Muhammad to have sex with any of his wives whenever he wants. ",
        "url":"https:\/\/quran.com\/66?startingVerse=1"
    },
    {
        "description":"Muhammad's wives need to be careful. If they criticize their husband - Allah will replace them with better ones.",
        "url":"https:\/\/quran.com\/66?startingVerse=5"
    },
    {
        "description":"The wives of Noah and Lot (who were both righteous) betrayed their husbands and are now in the Fire.",
        "url":"https:\/\/quran.com\/66?startingVerse=10"
    },
    {
        "description":"Only Muslims and those who preserve their chastity except with their wives and slave girls will be spared from hell.",
        "url":"https:\/\/quran.com\/70?startingVerse=1"
    },
    {
        "description":"You don't have to be chaste around your wives or your slave girls.",
        "url":"https:\/\/quran.com\/70?startingVerse=29"
    },
    {
        "description":"Those in the Gardens will have maidens for companions.",
        "url":"https:\/\/quran.com\/78?startingVerse=33"
    }
]